// logical operator


// and &&


const data="string" && 25 ;
console.log(data);/* 25 */
// عملگر اند منطقی وقتی بین چند عبارت تروسی قرارا میگیره میاد اخرین عبارت تروسی رو برای ما لاگ میگیره

const data2=null && undefined;
console.log(data2);/* null */
// عملگر اند منطقی وقتی بین چند عبارت فالسی قرار بگیره میاد اولین عبارت فالسی رو لاگ میگیره


// از عملگر اند توی شرطها استفاده میشه و نکته مهمش این که اگه هر دو سمت معامله یا شرط ترو نباشه اجرا نمیشه 

const data3=5;
if(data3< 6 && data3 <7){
    console.log("ok")
};
console.log(data3 > 2 && "hello");
// در ری اکت در مبحث کاندشینال رندرینگ پر کاربرد است



// logical or  ||

const user="string" || 25;
console.log(user);/* string */
// لوجیکال اور وقتی بین چند عبارت تروسی قرار بگیره میاد اولین عبارت تروسی رو نشون میده

const user1=null || undefined;
console.log(user1);/* undefined */

// وقتی بین چند عبارت فالسی قرار بگیره اخرین عبارت فالسی رو نشون میده

// از این عملگرهم در شرطها اتسفتده میشه ولی براش مهم نیست هردو سمت معامله یا شرط ترو باشد یکیش ترو باشه شرط رو اجرا میکنه

const user2=5;
if(user2 > 8 || user2 < 8) {
    console.log("ok")
};


// < > <= >= 

// false => true
// true => false

const boolean=true;
console.log(!boolean);/* false */
// با گذاشتن علامت تعجب قبل از اسم متغیر اون از ترو به فالس و از فالس به ترو میشه تبدیل کرد


const n1=5;
const n2=5;
const n3="5";
console.log(n1==n2);/* true */
console.log(n1!=n2);/* false */


console.log(n1==n2);/* true */
console.log(n1==n3);/* true */
console.log(n1===n3);/* false */

// چرا تو سه تا مساوی فالس شد؟
// چون سه تا مساوی مقایسه سختگیرانه رو انجام میده و میگه دیتا تایپ
// یک رشته برابر نیست با یک نامبر
// چرا تو دوتا مساوی ترو شد پس؟
// چون در دوتا مساوی قبل از اجرا واقعی کدها جاوا اسکیرپت میاد اگه از نظر شکل ظاهری برابر
// بودند یک تبدیل موقتی رو انجام میده و رشته رو تبدیل به نامبر می کنه


console.log("5"==5);/* true */
console.log(true == 1); /* true */
console.log(false == 0);/* true */
console.log(''==0);/* true */
console.log([9]==9);/* true */
// قسمت اخر ارایه تبدیل به پریمیتیو شد بعد تبدیل به رشته شد بعد تبدیل به نامبر شد 

